app/controllers/articles_controller.rb

	def show
		@article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 6) LIMIT 1

	def create
		@article = Article.new(params[:article])

		if @article.save
---
INSERT INTO "articles" ("created_at", "text", "title", "updated_at") VALUES ('2014-04-24 09:54:53.402376', 'dfgdfgdfgd', 'sdfsd', '2014-04-24 09:54:53.402376')

	def edit
		@article = Article.find(params[:id])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 4) LIMIT 1

	def update
		@article = Article.find(params[:id])

		if @article.update_attributes(params[:article])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 4) LIMIT 1
UPDATE "articles" SET "text" = 'v sdfbgd fbcfvbccv dgdf gfdg', "updated_at" = '2014-04-24 13:04:37.458342' WHERE ("articles"."id" = 11)

	def destroy
		@article = Article.find(params[:id])
		@article.destroy
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 7) LIMIT 1
DELETE FROM "articles" WHERE ("articles"."id" = 7)