app/controllers/comments_controller.rb

	def create
		@article = Article.find(params[:article_id])
		@comment = @article.comments.create(params[:comment])
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 2) LIMIT 1
INSERT INTO "comments" ("article_id", "body", "commenter", "created_at", "updated_at") VALUES (2, 'First comment''s content', 'First comment', '2014-04-24 13:21:23.460662', '2014-04-24 13:21:23.460662')

	def destroy
		@article = Article.find(params[:article_id])
		@comment = @article.comments.find(params[:id])
		@comment.destroy
---
SELECT "articles".* FROM "articles" WHERE ("articles"."id" = 2) LIMIT 1
SELECT "comments".* FROM "comments" WHERE ("comments".article_id = 2) AND ("comments"."id" = 1) LIMIT 1
DELETE FROM "comments" WHERE ("comments"."id" = 1)